Autodesk.Revit.UI.AToastNotificationDuration
The duration of the notification timer.
Remarks:
Currently, no public interface is provided to keep the toast notification on without the timer limit, even though user may cancel the notification.
Since:
2020.1
Since:
2020.1

Autodesk.Revit.UI.AToastNotificationDuration.AlwaysOn
The toast notification stays on until the user closes it or the next message comes in.

Autodesk.Revit.UI.AToastNotificationDuration.Long
The long duration to keep the toast notification for 25 seconds.

Autodesk.Revit.UI.AToastNotificationDuration.Short
The default duration to keep the toast notification for 7 seconds.